am/OpenFOAM-10/tutorials/multiphase/interFoam/RAS/propeller/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "propeller-innerCylinder.obj"
    "propeller-outerCylinder.obj"
    "propeller.obj"
);

// Identify a feature when angle between faces < includedAngle
includedAngle   150;

trimFeatures
{
    // Remove features with fewer than the specified number of edges
    minElem         10;
}

// ************************************************************************* //
